[{"question": "who started pixar?", "task_id": "WebQTrn-248", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kk9v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kk9v ns:organization.organization.founders ?x .\n}\n"], "answer": ["Edwin Catmull", "Steve Jobs"]}, {"question": "who did hera marry?", "task_id": "WebQTrn-277", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03g3c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03g3c ns:fictional_universe.fictional_character.married_to ?y .\n?y ns:fictional_universe.marriage_of_fictional_characters.spouses ?x .\n}\n"], "answer": ["Zeus"]}, {"question": "who speaks farsi?", "task_id": "WebQTrn-376", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.032f6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.032f6 ns:language.human_language.countries_spoken_in ?x .\n}\n"], "answer": ["Bahrain", "Seljuk Empire", "Iran", "Oman", "Tajikistan", "Uzbekistan", "Iraq", "Canada"]}, {"question": "who was louis riel?", "task_id": "WebQTrn-426", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04qqn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04qqn ns:people.person.profession ?x .\n}\n"], "answer": ["Politician"]}, {"question": "who's kobe bryant?", "task_id": "WebQTrn-473", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kmd4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01kmd4 ns:people.person.profession ?x .\n}\n"], "answer": ["Athlete", "Basketball player"]}, {"question": "what shows did henry winkler produce?", "task_id": "WebQTrn-595", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.024jwt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.024jwt ns:tv.tv_producer.programs_produced ?y .\n?y ns:tv.tv_producer_term.program ?x .\n}\n"], "answer": ["MacGyver", "Who Are the DeBolts? And Where Did They Get Nineteen Kids?", "Dallas Reunion: The Return to Southfork", "Dead Man's Gun", "So Weird", "Mr. Sunshine", "WinTuition"]}, {"question": "who was tex beneke?", "task_id": "WebQTrn-605", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.076yxy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.076yxy ns:people.person.profession ?x .\n}\n"], "answer": ["Bandleader", "Saxophonist", "Musician", "Singer"]}, {"question": "who is james dean?", "task_id": "WebQTrn-908", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01w32s8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01w32s8 ns:people.person.profession ?x .\n}\n"], "answer": ["Actor"]}, {"question": "who was dan cody?", "task_id": "WebQTrn-973", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07m5fb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07m5fb ns:people.person.profession ?x .\n}\n"], "answer": ["American football player"]}, {"question": "who is aidan davis?", "task_id": "WebQTrn-1013", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.080p6xw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.080p6xw ns:people.person.profession ?x .\n}\n"], "answer": ["Presenter", "Dancer"]}, {"question": "where is mallorca?", "task_id": "WebQTrn-1240", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g52z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g52z ns:geography.island.body_of_water ?x .\n}\n"], "answer": ["Mediterranean Sea"]}, {"question": "who was louis xvi?", "task_id": "WebQTrn-1384", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dj9w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dj9w ns:royalty.noble_person.titles ?y .\n?y ns:royalty.noble_title_tenure.noble_title ?x .\n}\n"], "answer": ["Duke of Normandy", "King of France", "King of Navarre"]}, {"question": "who's betty white?", "task_id": "WebQTrn-1979", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025mb_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025mb_ ns:people.person.profession ?x .\n}\n"], "answer": ["Presenter", "Comedian", "Actor", "Television producer", "Singer", "Writer", "TV Personality", "Author", "Voice Actor"]}, {"question": "who shot j lennon?", "task_id": "WebQTrn-1992", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vsl3_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vsl3_ ns:user.alexander.misc.murdered_person.murdered_by ?x .\n}\n"], "answer": ["Mark David Chapman"]}, {"question": "who started google?", "task_id": "WebQTrn-2393", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0387r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0387r ns:law.invention.inventor ?x .\n}\n", "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.045c7b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.045c7b ns:organization.organization.founders ?x .\n}\n"], "answer": ["Larry Page", "Sergey Brin"]}, {"question": "who is john garcia?", "task_id": "WebQTrn-2428", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_lpf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_lpf ns:people.person.profession ?x .\n}\n"], "answer": ["Musician", "Singer"]}, {"question": "where is usc from?", "task_id": "WebQTrn-2674", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03tw2s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03tw2s ns:location.location.containedby ?x .\n}\n", "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.065y4w7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.065y4w7 ns:location.location.containedby ?x .\n}\n", "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.065y4w7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.065y4w7 ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.065y4w7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.065y4w7 ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.state_province_region ?x .\n}\n"], "answer": ["South Carolina", "United States of America", "Columbia", "California", "Los Angeles"]}, {"question": "where is madeira?", "task_id": "WebQTrn-2830", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_z1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_z1 ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n", "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_z1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_z1 ns:location.administrative_division.country ?x .\n}\n", "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_z1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_z1 ns:location.administrative_division.first_level_division_of ?x .\n}\n", "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_z1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_z1 ns:location.location.containedby ?x .\n}\n"], "answer": ["Portugal", "Azores Canaries Madeira", "Madeira Islands archipelago", "Atlantic Ocean"]}, {"question": "where is bosnia?", "task_id": "WebQTrn-2865", "dsl_code": ["PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0166b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0166b ns:base.locations.countries.continent ?x .\n}\n", "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0166b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0166b ns:location.location.containedby ?x .\n}\n"], "answer": ["Europe", "Balkans", "Eurasia"]}]